import React from 'react';
import {FlatList} from 'react-native';

const FlatList = () => {

  return (
   <FlatList data={} renderItem={}
  );
};

export default FlatList;
// FLatList получить с апи все офферы
// Все офферы записать в редакс
// В наверстаном флэтЛисте в пропсы рендерАйтема прокидывать карточки которые надо отрисовать
// В компоненте табс будет компонент ТАБ, в компоненте ТАБ будем управлять всей логикой по переключению OnChange change Redux state
// Внутри флэтлиста по стейту активной вкладки которую мы засетили мы будем доставать нужные нам офферы
// получить все пропсы
